src/Documents/PayrollCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>PayrollCalculation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.PaymentDeductionKinds</xr:Item>
				<xr:Item>AccumulationRegister.HumanResourcesAccounting</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PaymentsDeductions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Position</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Positions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentDeductionKind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PaymentDeductionKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StartDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DaysWorked</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HoursWorked</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountOfExpenses</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CustomerOrder</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ManualCorrection</Name>
							<Comment>Manual adjustment</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/CurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>CurrencyRates</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/PaymentDeductionTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>PaymentDeductionTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Payment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Deduction</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/AccountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>AccountTypes</Name>
			<Comment>Oredered by balance sections</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Bank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsReceivable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccumulatedDepreciation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherNonCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsPayable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongTermLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Equity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/PayrollCalculation/Ext/ManagerModule.bsl
// Generates a value tables that contains document tabular section data.
// Value tables are saved in the AdditionalProperties structure properties.
//
Procedure DataInitializationDocument(DocumentRefPayroll, StructureAdditionalProperties) Export
            
	Query = New Query(        
	"SELECT
	|	&Company AS Company,
	|	PayrollPaymentsDeductions.LineNumber AS LineNumber,
	|	PayrollPaymentsDeductions.Ref.Date AS Period,
	|	PayrollPaymentsDeductions.Ref.AccountingPeriod AS AccountingPeriod,
	|	PayrollPaymentsDeductions.Ref.DocumentCurrency AS Currency,
	|	PayrollPaymentsDeductions.Employee AS Employee,
	|	PayrollPaymentsDeductions.AccountOfExpenses AS AccountOfExpenses,
	|	PayrollPaymentsDeductions.CustomerOrder AS CustomerOrder,
	|	PayrollPaymentsDeductions.StartDate AS StartDate,
	|	PayrollPaymentsDeductions.EndDate AS EndDate,
	|	PayrollPaymentsDeductions.DaysWorked AS DaysWorked,
	|	PayrollPaymentsDeductions.HoursWorked AS HoursWorked,
	|	PayrollPaymentsDeductions.Rate AS Rate,
	|	PayrollPaymentsDeductions.PaymentDeductionKind AS PaymentDeductionKind,
	|	CAST(PayrollPaymentsDeductions.Amount * AccountsCurrencyRates.ExchangeRate * AccountingCurrencyRates.Multiplicity / (AccountingCurrencyRates.ExchangeRate * AccountsCurrencyRates.Multiplicity) AS NUMBER(15, 2)) AS Amount,
	|	PayrollPaymentsDeductions.Amount AS AmountCur
	|INTO TablePayments
	|FROM
	|	Document.PayrollCalculation.PaymentsDeductions AS PayrollPaymentsDeductions
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(
	|				&PointInTime,
	|				Currency IN
	|					(SELECT
	|						Constants.DefaultCurrency
	|					FROM
	|						Constants AS Constants)) AS AccountingCurrencyRates
	|		ON (TRUE)
	|		LEFT JOIN Constants AS Constants
	|		ON (TRUE)
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(&PointInTime, ) AS AccountsCurrencyRates
	|		ON PayrollPaymentsDeductions.Ref.DocumentCurrency = AccountsCurrencyRates.Currency
	|WHERE
	|	PayrollPaymentsDeductions.Ref = &Ref
	|;
	|
	|
	|SELECT
	|	&Company AS Company,
	|	PayrollPaymentsDeductions.Period AS Period,
	|	PayrollPaymentsDeductions.AccountingPeriod AS AccountingPeriod,
	|	PayrollPaymentsDeductions.Currency AS Currency,
	|	PayrollPaymentsDeductions.Employee AS Employee,
	|	PayrollPaymentsDeductions.StartDate AS StartDate,
	|	PayrollPaymentsDeductions.EndDate AS EndDate,
	|	PayrollPaymentsDeductions.DaysWorked AS DaysWorked,
	|	PayrollPaymentsDeductions.HoursWorked AS HoursWorked,
	|	PayrollPaymentsDeductions.Rate AS Rate,
	|	PayrollPaymentsDeductions.PaymentDeductionKind AS PaymentDeductionKind,
	|	PayrollPaymentsDeductions.Amount AS Amount,
	|	PayrollPaymentsDeductions.AmountCur AS AmountCur
	|FROM
	|	TablePayments AS PayrollPaymentsDeductions
	|;
	|
	|
	|SELECT
	|	&Company AS Company,
	|	PayrollPaymentsDeductions.Period AS Period,
	|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
	|	PayrollPaymentsDeductions.AccountingPeriod AS AccountingPeriod,
	|	PayrollPaymentsDeductions.Currency AS Currency,
	|	PayrollPaymentsDeductions.Employee AS Employee,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	|			THEN PayrollPaymentsDeductions.AmountCur
	|		ELSE -1 * PayrollPaymentsDeductions.AmountCur
	|	END AS AmountCur,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	|			THEN PayrollPaymentsDeductions.Amount
	|		ELSE -1 * PayrollPaymentsDeductions.Amount
	|	END AS Amount,
	|	PayrollPaymentsDeductions.Employee.HumanResourcesAccount AS Account,
	|	VALUE(AccountingRecordType.Credit) AS RecordKindGeneralJournal,
	|	&Payroll AS ContentOfAccountingRecord
	|FROM
	|	TablePayments AS PayrollPaymentsDeductions
	|WHERE
	|	PayrollPaymentsDeductions.AmountCur <> 0
	|;
	|
	|
	|SELECT
	|	PayrollPaymentsDeductions.LineNumber AS LineNumber,
	|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
	|	PayrollPaymentsDeductions.Period AS Period,
	|	&Company AS Company,
	|	PayrollPaymentsDeductions.AccountOfExpenses AS AccountOfExpenses,
	|	PayrollPaymentsDeductions.AccountOfExpenses AS Account,
	|	PayrollPaymentsDeductions.CustomerOrder AS CustomerOrder,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Deduction)
	|			THEN -1 * PayrollPaymentsDeductions.Amount
	|		ELSE PayrollPaymentsDeductions.Amount
	|	END AS Amount,
	|	VALUE(AccountingRecordType.Debit) AS RecordKindGeneralJournal,
	|	TRUE AS FixedCost,
	|	&Payroll AS ContentOfAccountingRecord
	|FROM
	|	TablePayments AS PayrollPaymentsDeductions
	|WHERE
	|	(PayrollPaymentsDeductions.AccountOfExpenses.AccountType = VALUE(Enum.AccountTypes.OtherNonCurrentAsset)
	|			OR PayrollPaymentsDeductions.AccountOfExpenses.AccountType = VALUE(Enum.AccountTypes.CostOfSales))
	|	AND 
	| PayrollPaymentsDeductions.AmountCur <> 0
	|;
	|
	|
	|SELECT
	|	PayrollPaymentsDeductions.LineNumber AS LineNumber,
	|	PayrollPaymentsDeductions.Period AS Period,
	|	&Company AS Company,
	|	PayrollPaymentsDeductions.AccountOfExpenses AS Account,
	|	PayrollPaymentsDeductions.AccountOfExpenses AS AccountOfExpenses,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Deduction)
	|			THEN -1 * PayrollPaymentsDeductions.Amount
	|		ELSE PayrollPaymentsDeductions.Amount
	|	END AS ExpenseAmount,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Deduction)
	|			THEN -1 * PayrollPaymentsDeductions.Amount
	|		ELSE PayrollPaymentsDeductions.Amount
	|	END AS Amount,
	|	PayrollPaymentsDeductions.CustomerOrder AS CustomerOrder,
	|	VALUE(AccountingRecordType.Debit) AS RecordKindGeneralJournal,
	|	&Payroll AS ContentOfAccountingRecord
	|FROM
	|	TablePayments AS PayrollPaymentsDeductions
	|WHERE
	|	PayrollPaymentsDeductions.AccountOfExpenses.AccountType = VALUE(Enum.AccountTypes.Expense)
	|	AND 
	|   PayrollPaymentsDeductions.AmountCur <> 0
	|;
	|
	|
	|SELECT
	|	PayrollPaymentsDeductions.LineNumber AS LineNumber,
	|	PayrollPaymentsDeductions.Period AS Period,
	|	&Company AS Company,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	|			THEN PayrollPaymentsDeductions.AccountOfExpenses
	|		ELSE PayrollPaymentsDeductions.Employee.HumanResourcesAccount
	|	END AS AccountDr,
	|	UNDEFINED AS CurrencyDr,
	|	0 AS AmountCurrencyDr,
	|	CASE
	|		WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	|			THEN PayrollPaymentsDeductions.Employee.HumanResourcesAccount
	|		ELSE PayrollPaymentsDeductions.AccountOfExpenses
	|	END AS AccountCr,
	|	UNDEFINED AS CurrencyCr,
	|	0 AS AmountCurrencyCr,
	|	PayrollPaymentsDeductions.Amount AS Amount,
	|	&Payroll AS Content
	|FROM
	|	TablePayments AS PayrollPaymentsDeductions
	|WHERE
	|	PayrollPaymentsDeductions.AmountCur <> 0");
	
	Query.SetParameter("Ref", DocumentRefPayroll);
	Query.SetParameter("PointInTime", New Boundary(StructureAdditionalProperties.ForPosting.PointInTime, BoundaryType.Including));
	Query.SetParameter("Company", StructureAdditionalProperties.ForPosting.Company);
	Query.SetParameter("Payroll", NStr("en = 'Payroll'"));
	    	
	ResultsArray = Query.ExecuteBatch();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TablePaymentDeductionKinds", ResultsArray[1].Unload());
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableHumanResourcesAccounting", ResultsArray[2].Unload());
    StructureAdditionalProperties.TableForRegisterRecords.Insert("TableInventory", ResultsArray[3].Unload());
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableIncomeAndExpenses", ResultsArray[4].Unload());
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableGeneralJournal", ResultsArray[5].Unload());
	
EndProcedure

// Checks for the negative balance.
//
Procedure RunControl(DocumentRefPayroll, AdditionalProperties, Cancellation, PostingDelete = False) Export
	
	If Not _DemoPayrollAndHRServer.RunBalanceControl() Then
		Return;
	EndIf;

	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
EndProcedure
